{
  "id": "copyright_level_5",
  "realmId": "realm_copyright",
  "levelNumber": 5,
  "name": "Ownership, Term, & The Public Domain",
  "description": "Who owns the copyright? And for how long? Learn the rules of ownership and the 'end of the line'—the Public Domain.",
  "summary": "This level explains the 'Life + 60 years' rule for copyright duration in India. You'll also learn the difference between being a 'freelance' creator and an 'employee' (work-for-hire), and what the Public Domain is.",
  
  "videoUrl": "https://youtu.be/XzzkSZ0Jrko?si=yNGGFPXIRVhfHsOI",
  "videoDuration": 160,
  
  "content": "## Who Owns the Copyright?\n\nThis seems simple, but it has one very important exception.\n\n**The General Rule:** The 'author' of the work is the first owner of the copyright. \n- If you write a poem, you own the copyright.\n- If you compose a song, you own the copyright.\n\n**The BIG Exception: 'Work for Hire'**\nThis is a critical concept for students to understand as they enter the job market.\n\nIf you create a work:\n1.  As part of your duties as an **employee** (under a 'contract of service')...\n2.  ...then your **employer** is the first owner of the copyright, not you.\n\n--- \n\n### 💡 Level 5 Case Study: Coder vs. Photographer\n\n* **Case A (Work for Hire):** 'Priya' is a salaried software developer at a tech company. She writes 10,000 lines of code for a new app *as part of her job*. The **company** owns the copyright to that code, not Priya.\n\n* **Case B (Freelancer):** 'Rohan' is a freelance photographer. The *same* tech company hires him to take photos for their website (under a 'contract for service'). **Rohan** owns the copyright to the photos, and he *licenses* them to the company. \n\nUnless the freelance contract explicitly states 'all copyright is transferred to the company', the creator (Rohan) remains the owner.\n\n--- \n\n## How Long Does Copyright Last?\n\nCopyright does not last forever. It has an expiration date. \n\nIn India, for most works (like literature, art, music), the rule is:\n\n> **The lifetime of the author + 60 years**\n\nThe 60-year period starts from the beginning of the calendar year *after* the year in which the author dies.\n\n**Example:** Rabindranath Tagore died in 1941. His works entered the public domain in India on January 1st, 2002 (1941 + 60 years = 2001. So, free from Jan 1st, 2002).\n\n## What is the 'Public Domain'?\n\nWhen the copyright term expires, the work enters the **Public Domain**. \n\nThis means it no longer has an owner. It belongs to everyone. Once a work is in the public domain, anyone can use it, copy it, adapt it, or sell it for free, without asking for permission.\n\nThis is why anyone can publish a copy of Shakespeare's plays or Beethoven's symphonies. Their copyright has long expired!",
  
  "keyPoints": [
    "The 'author' is the first owner of copyright, UNLESS it's a 'work for hire'.",
    "For employees, the employer is usually the first owner of the copyright.",
    "The standard copyright term in India is the 'lifetime of the author + 60 years'.",
    "Works with expired copyrights enter the 'Public Domain'.",
    "Public Domain works are free for anyone to use, copy, and adapt without permission."
  ],
  
  "learningObjectives": [
    "Identify the first owner of copyright in a creative work.",
    "Explain the 'work for hire' exception and its impact on employees.",
    "State the standard term of copyright protection in India.",
    "Define the 'Public Domain' and explain its importance."
  ],
  
  "difficulty": "Medium",
  "xpReward": 200,
  "estimatedMinutes": 12,
  
  "quizEnabled": true,
  "questionsPerAttempt": 5,
  "passingScore": 60,
  
  "version": "1.0.0",
  "updatedAt": "2025-11-10T17:30:00Z"
}